"""
СПИСОК МОДУЛЕЙ ДЛЯ РЕАЛИЗАЦИИ
1. Модуль ядра (подмодули логгирования, common utils, чтение конфигов)
2. Модуль привязки майнкрафт чата (либо привязка напрямую, либо через DiscordSRV)
3. Модуль привязки дискорд чата (функциональность: возможность привязывать чаты через id чата, отправка embed, привязка вебхуков)
4. Модуль взаимодействия в телеграм (отправка красивых сообщений, базовая модерация, сбор статистики)
5. Модуль работы с базой данных

НЕОБЯЗАТЕЛЬНО
1. Реализация API (для чего? а хуй знает, звучит по-умному, значит пишем :roflanEbalo:)
"""

import yaml

async def run() -> None:
    # Запуск всех систем и модулей
    ...